; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v1)
		(pred_1 ?v4)
		(pred_2 ?v7)
		(pred_6 ?v7)
		(pred_3 ?v4 ?v7)
		(pred_4)
		(pred_5 ?v4))

   (:action op_3
       :parameters  (?v5 ?v8)
       :precondition (and (not-eq ?v5 ?v8) 
                          (pred_2 ?v5) (pred_2 ?v8) (pred_6 ?v5))
       :effect (and  (pred_6 ?v8)
		     (not (pred_6 ?v5))))


   (:action op_1
       :parameters (?v6 ?v2)
       :precondition  (and  (pred_1 ?v6) (pred_2 ?v2)
			    (pred_3 ?v6 ?v2) (pred_6 ?v2) (pred_4))
       :effect (and (pred_5 ?v6)
		    (not (pred_3 ?v6 ?v2)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v6  ?v2)
       :precondition  (and  (pred_1 ?v6) (pred_2 ?v2)
			    (pred_5 ?v6) (pred_6 ?v2))
       :effect (and (pred_3 ?v6 ?v2)
		    (pred_4)
		    (not (pred_5 ?v6)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_02 obj_07 obj_08 obj_01 obj_04 obj_03 
          obj_05 obj_06 obj_09 
)
(:init
(pred_2 obj_02)
(pred_2 obj_07)
(pred_2 obj_08)
(pred_2 obj_01)
(pred_2 obj_04)
(pred_2 obj_03)
(pred_1 obj_05)
(pred_1 obj_06)
(pred_1 obj_09)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(pred_4)
(pred_3 obj_05 obj_07)
(pred_3 obj_06 obj_08)
(pred_3 obj_09 obj_02)
(pred_6 obj_08)
)
(:goal
(and
(pred_3 obj_05 obj_07)
(pred_3 obj_06 obj_08)
(pred_3 obj_09 obj_03)
)
)

(:constraints
  (sometime-before  (pred_3 obj_09 obj_03) (pred_6 obj_07))
)
)

; plan
1. (op_3 obj_08 obj_07)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_07)
   goals met: 2 of 3
2. (op_1 obj_05 obj_07)
   deleted: (pred_3 obj_05 obj_07) (pred_4)
   added: (pred_5 obj_05)
   goals met: 1 of 3
3. (op_3 obj_07 obj_02)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_02)
   goals met: 1 of 3
4. (op_2 obj_05 obj_02)
   deleted: (pred_5 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_4)
   goals met: 1 of 3
5. (op_1 obj_09 obj_02)
   deleted: (pred_3 obj_09 obj_02) (pred_4)
   added: (pred_5 obj_09)
   goals met: 1 of 3
6. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_03)
   goals met: 1 of 3
7. (op_2 obj_09 obj_03)
   deleted: (pred_5 obj_09)
   added: (pred_3 obj_09 obj_03) (pred_4)
   goals met: 2 of 3
8. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 2 of 3
9. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_4)
   added: (pred_5 obj_05)
   goals met: 2 of 3
10. (op_3 obj_02 obj_07)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_07)
   goals met: 2 of 3
11. (op_2 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_3 obj_05 obj_07) (pred_4)
   goals met: 3 of 3
